
                ifndef _INVENTORY_RELEASE_
                define _INVENTORY_RELEASE_
; -----------------------------------------
; освобождение ресурсов и модуля "инвентаря"
; In:
; Out:
; Corrupt:
;   HL, DE, BC, AF, AF', IX
; Note:
;   перед вызовом необходимо завершить использование модуля
;   возврат должен выполняться в код вне освобождаемого модуля
; -----------------------------------------
Release:        ; освобождение ассета модуля инвентаря
                JP_RELEASE_ASSETS_IN_PAGE ASSETS_ID_INVENTORY                   ; освобождение ассета с восстановлением страницы

                endif ; ~_INVENTORY_RELEASE_
