
                ifndef _INVENTORY_RENDER_DRAW_
                define _INVENTORY_RENDER_DRAW_
; -----------------------------------------
; отображение "инвентаря"
; In:
; Out:
; Corrupt:
;   HL, DE, BC, AF, IX
; Note:
;   ℹ️ код расположен в "общей памяти"
; -----------------------------------------
Draw:           ; -----------------------------------------
                ; точка входа отображения
                ; -----------------------------------------

.Transiton      ; -----------------------------------------
                ; переход между циклами
                ; -----------------------------------------
                ; проверка запроса перехода между циклами
                CHECK_MAIN_FLAG ML_TRANSITION_BIT
                JR Z, .Enter                                                    ; переход, если переход между циклами не запрошен

.Enter          ; -----------------------------------------
                ; первичная инициализация
                ; -----------------------------------------
                ; проверка запроса первичной инициализации
                CHECK_MAIN_FLAG ML_ENTER_BIT
                JR Z, .Update                                                   ; переход, если первичная инициализация не запрошена

                ; сброс возможности восстановления фона курсора
                SET_PAGE_SCREEN_SHADOW                                          ; включение страницы теневого экрана
                LD HL, Adr.CursorStorageA
                LD (HL), #00                                                    ; 0 байт хранит данные о размере заполнения
                INC H
                LD (HL), #00                                                    ; 0 байт хранит данные о размере заполнения

.Update         ; -----------------------------------------
                ; обновление
                ; -----------------------------------------
                ; проверка запроса обновления
                CHECK_MAIN_FLAG ML_UPDATE_BIT
                JR Z, .Tick                                                     ; переход, если обновление не запрошено

.Tick           ; -----------------------------------------
                ; тик
                ; -----------------------------------------
                ; проверка пересечения курсором UI элементов
                SET_MODULE_PAGE_Inventory                                       ; включить страницу модуля "инвентаря"
                CALL UI.Update
                CALL Inventory.Display.Slots                                    ; отображение слотов

                ; сброс обработанных флагов главного цикла
                RES_ALL_MAIN_FLAGS                                              ; сброс всех флагов

                ; проверка возможности начать обработку запроса смены UI режима
                CALL UI.Runtime.Process
                RET NC                                                          ; выход, если переход UI режима не начат

                JP Inventory.SharedCode.UI.Transition.World                     ; запуск перехода UI инвентаря в мир

                display " - Main draw:\t\t\t\t\t\t", /A, Draw, "\t= busy [ ", /D, $-Draw, " byte(s)  ]"

                endif ; ~_INVENTORY_RENDER_DRAW_
