
                ifndef _INVENTORY_RENDER_DRAW_
                define _INVENTORY_RENDER_DRAW_
; -----------------------------------------
; отображение "инвентаря"
; In:
; Out:
; Corrupt:
;   HL, DE, BC, AF, HL', DE', BC', AF', IX, IY
; Note:
;   ℹ️ код расположен в "общей памяти"
; -----------------------------------------
Draw:           ; -----------------------------------------
                ; точка входа отображения
                ; -----------------------------------------

.Transiton      ; -----------------------------------------
                ; переход между циклами
                ; -----------------------------------------
                ; проверка запроса перехода между циклами
                CHECK_MAIN_FLAG ML_TRANSITION_BIT
                JR Z, .Enter                                                    ; переход, если переход между циклами не запрошен

.Enter          ; -----------------------------------------
                ; первичная инициализация
                ; -----------------------------------------
                ; проверка запроса первичной инициализации
                CHECK_MAIN_FLAG ML_ENTER_BIT
                JR Z, .Update                                                   ; переход, если первичная инициализация не запрошена

                ; сброс возможности восстановления фона курсора
                SET_PAGE_SCREEN_SHADOW                                          ; включение страницы теневого экрана
                LD HL, Adr.CursorStorageA
                LD (HL), #00                                                    ; 0 байт хранит данные о размере заполнения
                INC H
                LD (HL), #00                                                    ; 0 байт хранит данные о размере заполнения
                RES_FLAG_MODIFY CursorCopyGate.Flag                              ; разрешение работы с буфером курсора

.Update         ; -----------------------------------------
                ; обновление
                ; -----------------------------------------
                ; проверка запроса обновления
                CHECK_MAIN_FLAG ML_UPDATE_BIT
                JR Z, .Tick                                                     ; переход, если обновление не запрошено

.Tick           ; -----------------------------------------
                ; тик
                ; -----------------------------------------
                
                SET_MODULE_PAGE_Inventory                                       ; включение страницы модуля инвентаря
                CALL UI.Update                                                  ; обновление UI
                CALL Inventory.Display.Slots                                    ; отображение слотов

                ; установка флагов готовности кадра и переноса экранов
                SET_RENDER_FLAGS FRAME_READY | SWAP_PENDING

                ; сброс обработанных флагов главного цикла
                RES_ALL_MAIN_FLAGS                                              ; сброс всех флагов
                RET
                display " - Main draw:\t\t\t\t\t\t", /A, Draw, "\t= busy [ ", /D, $-Draw, " byte(s)  ]"

                endif ; ~_INVENTORY_RENDER_DRAW_
