
                ifndef _MATH_EASING_EASE_OUT_
                define _MATH_EASING_EASE_OUT_

                module Math
; -----------------------------------------
; функция сглаживания - квадратичное сглаживание с плавным торможением
; In:
;   A  - аргумент функции сглаживания (0..255)
; Out:
;   A  - результат сглаживания (0..255)
; Corrupt:
; Note:
;   Ease-Out: движение начинается быстро и плавно замедляется к концу
;               f(t) = 1 - (1 - t)^2
; -----------------------------------------
EaseOut:        CPL                                                             ; A = 255 - t

                LD D, #00
                LD E, A                                                         ; DE = 255 - t
                ; -----------------------------------------
                ; умножение DE на A
                ; In :
                ;   DE - множимое
                ;   A  - множитель
                ; Out :
                ;   HL - результат умножения DE * A
                ; Corrupt :
                ;   HL, F
                ; -----------------------------------------
                MUL_16x8_16                                                     ; HL = (255 - t)^2

                ; -----------------------------------------
                ; Деление HL на 255
                ;
                ;   HL = H * 256 + L
                ;      = H * 255 + H + L
                ;
                ;   HL / 255 = H + (H + L) / 255
                ;
                ; При H <= #FE величина (H + L) требует
                ; только коррекции 0 или 1:
                ;
                ;   result = H + ((H + L) >= 255)
                ;
                ; INC сдвигает порог Carry с 256 на 255:
                ;
                ;   H + L >= 255
                ;   H + L + 1 >= 256 -> Carry
                ; -----------------------------------------
                LD A, H
                INC A
                ADD A, L                                                        ; флаг переполнения = (H + L) >= 255
                LD A, H
                ADC A, #00                                                      ; A = HL / 255

                CPL                                                             ; A = 255 - A
                RET

                display " - Easing EaseOut:\t\t\t\t\t", /A, EaseOut, "\t= busy [ ", /D, $-EaseOut, " byte(s)  ]"
                endmodule

                endif ; ~_MATH_EASING_EASE_OUT_
