
                ifndef _VFX_CROSSFADE_FALLING_BLOCKS_FUNCTIONS_CIRCLE_
                define _VFX_CROSSFADE_FALLING_BLOCKS_FUNCTIONS_CIRCLE_
; -----------------------------------------
; расчёт расстояния от блока до центра по круговой метрике
; In:
;   DE - смещения в блоках, D = dy [-11..11], E = dx [-15..15]
; Out:
;   A  - байтовая дистанция [0..173]
; Corrupt:
;   HL, DE, BC, AF
; Note:
;   ℹ️ код расположен в странице 7
;   A = (dx * dx + dy * dy + 1) / 2
;   деление целочисленное, нулевое значение только в центре
; -----------------------------------------
Circle:         ; расчёт суммы квадратов смещений

                ; -----------------------------------------
                ; расчёт квадрата расстояния
                ; In :
                ;   DE - дельта расстояния (D - y [-128..127], E - x [-128..127])
                ; Out :
                ;   HL - квадрат расстояния
                ;   DE - модули дельт расстояния (D - |y|, E - |x|)
                ; Corrupt :
                ;   HL, DE, BC, AF
                ; -----------------------------------------
                CALL Math.DistSquared

                ; расчёт байтовой дистанции с округлением вверх
                INC HL
                SRL H
                LD A, L
                RRA

                RET

                endif ; ~_VFX_CROSSFADE_FALLING_BLOCKS_FUNCTIONS_CIRCLE_
