
                ifndef _MODULE_INVENTORY_GRAPHICS_DISPLAY_ITEMS_
                define _MODULE_INVENTORY_GRAPHICS_DISPLAY_ITEMS_
; -----------------------------------------
; отображение предметов в инвентаре
; In:
; Out:
; Corrupt:
;   HL, DE, BC, AF, AF', IX, IY
; Note:
;   ℹ️ необходимо включить страницу модуля "инвентаря"
;   основной экран должен быть выбран перед вызовом
;   графический ресурс предметов должен быть загружен
;
;   ⚠️ ВАЖНО ⚠️
;   временно меняет страницу памяти
;   при выходе восстанавливает страницу вызывающего кода
; -----------------------------------------
Items:          ; положение и визуал пробного предмета
                LD A, #00                                                       ; индекс визуала пробного предмета
                LD DE, (SCR_INVENTORY_POS_Y << 8) | SCR_INVENTORY_POS_X         ; положение первой ячейки сетки в знакоместах

                ; расчёт смещения заголовка визуала по индексу
                LD L, A                                                         ; индекс визуала для расчёта смещения
                LD H, #00
                ADD HL, HL  ; x2
                ADD HL, HL  ; x4

                ; расчёт адреса заголовка внутри графического ресурса
.Address        EQU $+1                                                         ; операнд с адресом загруженного ресурса
                LD BC, #0000                                                    ; начало загруженного графического ресурса
                ADD HL, BC                                                      ; указатель на выбранный FItemVisual

                ; подготовка возврата на страницу модуля инвентаря
                PUSH_PAGE                                                       ; сохранение страницы вызывающего кода
                LD BC, Func.PopPage                                             ; адрес восстановления сохранённой страницы
                PUSH BC                                                         ; возврат через восстановление страницы инвентаря
                JP Inventory.SharedCode.Render.Item                             ; вывод предмета по указателю и позиции

                endif ; ~_MODULE_INVENTORY_GRAPHICS_DISPLAY_ITEMS_
