
                ifndef _ITEM_PLACEMENT_NEW_
                define _ITEM_PLACEMENT_NEW_
; -----------------------------------------
; размещение нового предмета
; In:
; Out:
;   HL - адрес записи FItem в конце массива
;   A  - страница массива предметов
;   A' - идентификатор предмета
;   IY - адрес соответствующей записи FItemLocation
;   флаг переполнения установлен, если нет места для размещения предмета
; Corrupt:
;   HL, BC, AF, AF', IY
; Note:
;   ℹ️ код расположен в "общей памяти"
; -----------------------------------------
PlacementNew:   ; получение адреса счётчика предметов
                LD HL, GameState.ItemsNum

                ; проверка переполнения массива предметов
                LD A, (HL)
                CP ITEM_MAX
                CCF
                RET C                                                           ; выход, если нет места для размещения предмета

                INC (HL)                                                        ; увеличение количества предметов в массиве
                LD L, A                                                         ; сохранение идентификатора новой записи
                EX AF, AF'                                                      ; сохранение идентификатора предмета

                ; получение адреса размещения новой записи
                LD A, L
                PUSH AF
                CALL Utilities.Location.HL
                SET_REGISTER IY, HL

                ; получение адреса экземпляра новой записи
                POP AF
                CALL Utilities.Address.HL
                OR A                                                            ; сброс флага, запись размещена
                RET

                endif ; ~_ITEM_PLACEMENT_NEW_

