
                ifndef _MEMORY_COPY_SCREEN_FILL_ATTRIBUTES_
                define _MEMORY_COPY_SCREEN_FILL_ATTRIBUTES_

                module Memcpy
                module Attributes
; -----------------------------------------
; заливка области атрибутов (обёртка)
; In:
;   HL' - адрес буфера конечных атрибутов
;   DE' - параметры заполнения области:
;         D' = 0 - заполнение атрибутов значением E'
;         D' = 1 - заполнение атрибутов через маску (HL') AND E'
; Out:
; Corrupt:
;   HL, DE, BC, AF, HL', DE', BC', IX, IY
; -----------------------------------------
Fill.Wrap       EXX
; -----------------------------------------
; заливка области атрибутов
; In:
;   HL - адрес буфера конечных атрибутов
;   DE - параметры заполнения области:
;        D = 0 - заполнение атрибутов значением E
;        D = 1 - заполнение атрибутов через маску (HL) AND E
; Out:
; Corrupt:
;   HL, DE, BC, AF, IX, IY
; Note:
;   - допустимая ширина: 2, 4, 6 знакомест
;   - высота должна быть ненулевой
;   - адрес области берётся из буфера, сохранённые данные не изменяются
; -----------------------------------------
Fill:           ; подготовка атрибута или маски для заливки области
                LD IYL, E

                ; проверка режима заливки области атрибутов
                LD IX, .Solid
                LD A, D
                OR A
                JR Z, $+6                                                       ; переход, если требуется заливка одним атрибутом
                LD IX, .Mask

                ; ℹ️ формат шапки:
                ;   +0 - ширина в знакоместах
                ;   +1 - высота в знакоместах
                ;   +2 - указатель на начало данных

                ; чтение размера области
                LD C, (HL)
                INC HL                                                          ; ширина области
                LD B, (HL)
                INC HL                                                          ; высота области

                ; чтение указателя на начало данных
                LD A, (HL)
                INC HL
                LD H, (HL)
                LD L, A

                ; ℹ️ формат данных:
                ;   +0 - адрес правого атрибута нижнего ряда
                ;   +2 - сохранённые данные

                ; чтение адреса правого атрибута нижнего ряда
                LD E, (HL)
                INC HL
                LD D, (HL)
                INC HL

.Row            ; сохранение размера области и адреса начала ряда
                PUSH BC
                PUSH DE

                ; расчёт количества пар атрибутов в ряду
                LD B, C
                SRL B

.Pair           ; заливка правого знакоместа сохранённой пары
                INC HL
                CALL_IX

                ; переход к левому атрибуту сохранённой пары
                DEC HL
                DEC DE
                CALL_IX

                ; переход к следующей сохранённой паре
                INC HL
                INC HL
                DEC DE

                ; проверка количества оставшихся пар атрибутов
                DJNZ .Pair

                ; восстановление адреса начала ряда и размера области
                POP DE
                POP BC

                ; проверка количества оставшихся рядов
                DJNZ .NextRow
                RET

.NextRow        ; расчёт адреса правого атрибута предыдущего ряда
                LD A, E
                SUB #20
                LD E, A
                JR NC, .Row                                                     ; переход, если заём из старшего байта адреса не требуется
                DEC D
                JR .Row

.Solid          ; заполнение знакоместа одним атрибутом
                LD A, IYL
                LD (DE), A
                RET

.Mask           ; применение маски к исходному атрибуту знакоместа
                LD A, IYL
                AND (HL)
                LD (DE), A
                RET

                endmodule
                endmodule

                endif ; ~_MEMORY_COPY_SCREEN_FILL_ATTRIBUTES_

