
                ifndef _CHARACTERISTICS_RENDER_DRAW_
                define _CHARACTERISTICS_RENDER_DRAW_
; -----------------------------------------
; отображение "характеристик"
; In:
; Out:
; Corrupt:
;   HL, AF
; Note:
;   отрисовка интерфейса характеристик пока отсутствует
; -----------------------------------------
Draw:           ; -----------------------------------------
                ; точка входа отображения
                ; -----------------------------------------

.Transiton      ; -----------------------------------------
                ; переход между циклами
                ; -----------------------------------------
                ; проверка запроса перехода между циклами
                CHECK_MAIN_FLAG ML_TRANSITION_BIT
                JR Z, .Enter                                                    ; переход, если переход между циклами не запрошен

.Enter          ; -----------------------------------------
                ; первичная инициализация
                ; -----------------------------------------
                ; проверка запроса первичной инициализации
                CHECK_MAIN_FLAG ML_ENTER_BIT
                JR Z, .Update                                                   ; переход, если первичная инициализация не запрошена

                ; сброс возможности восстановления фона курсора
                SET_PAGE_SCREEN_SHADOW                                          ; включение страницы теневого экрана
                LD HL, Adr.CursorStorageA
                LD (HL), #00                                                    ; 0 байт хранит данные о размере заполнения
                INC H
                LD (HL), #00                                                    ; 0 байт хранит данные о размере заполнения

.Update         ; -----------------------------------------
                ; обновление
                ; -----------------------------------------
                ; проверка запроса обновления
                CHECK_MAIN_FLAG ML_UPDATE_BIT
                JR Z, .Tick                                                     ; переход, если обновление не запрошено

.Tick           ; -----------------------------------------
                ; тик
                ; -----------------------------------------

                ; сброс обработанных флагов главного цикла
                ; RES_MAIN_FLAGS ML_TRANSITION | ML_ENTER | ML_UPDATE             ; сохранение запроса завершения цикла
                RES_ALL_MAIN_FLAGS                                              ; сброс всех флагов
                RET

                display " - Main draw:\t\t\t\t\t\t", /A, Draw, "\t= busy [ ", /D, $-Draw, " byte(s)  ]"

                endif ; ~_CHARACTERISTICS_RENDER_DRAW_
