
                ifndef _CHARACTERISTICS_RENDER_DRAW_
                define _CHARACTERISTICS_RENDER_DRAW_
; -----------------------------------------
; отображение "характеристик"
; In:
; Out:
; Corrupt:
;   HL, DE, BC, AF, AF', IX
; Note:
;   отрисовка интерфейса характеристик пока отсутствует
; -----------------------------------------
Draw:           ; -----------------------------------------
                ; точка входа отображения
                ; -----------------------------------------

.Transiton      ; -----------------------------------------
                ; переход между циклами
                ; -----------------------------------------
                ; проверка запроса перехода между циклами
                CHECK_MAIN_FLAG ML_TRANSITION_BIT
                JR Z, .Enter                                                    ; переход, если переход между циклами не запрошен

                ; проигрывание перехода с экрана мира
                CALL Characteristics.SharedCode.UI.Transition.FallingBlocks

.Enter          ; -----------------------------------------
                ; первичная инициализация
                ; -----------------------------------------
                ; проверка запроса первичной инициализации
                CHECK_MAIN_FLAG ML_ENTER_BIT
                JR Z, .Update                                                   ; переход, если первичная инициализация не запрошена

.Update         ; -----------------------------------------
                ; обновление
                ; -----------------------------------------
                ; проверка запроса обновления
                CHECK_MAIN_FLAG ML_UPDATE_BIT
                JR Z, .Tick                                                     ; переход, если обновление не запрошено

.Tick           ; -----------------------------------------
                ; тик
                ; -----------------------------------------

                ; сброс обработанных флагов главного цикла
                RES_MAIN_FLAGS ML_TRANSITION | ML_ENTER | ML_UPDATE             ; сохранение запроса завершения цикла
                RET

                display " - Main draw:\t\t\t\t\t\t", /A, Draw, "\t= busy [ ", /D, $-Draw, " byte(s)  ]"

                endif ; ~_CHARACTERISTICS_RENDER_DRAW_
