
                ifndef _FUNCTIONS_ASSET_UTILS_
                define _FUNCTIONS_ASSET_UTILS_
; -----------------------------------------
; проверка перед запуском ресурса
; In:
;   A - идентификатор ресурса
; Out:
;   A - идентификатор ресурса
; Corrupt:
;   BC, IX
; Note:
;   ℹ️ код расположен в Kernel
;      необходимо включить страницу менеджера ресурсов
; -----------------------------------------
PreLaunchCheck  ; сохранение идентификатора ресурса
                PUSH AF

                ; расчёт адреса структуры ресурса
                ASSETS_ADR_A

                ; проверка наличия ресурса в памяти
                BIT ASSETS_LOAD_BIT, (IX + FAssets.Flags)
                JR NZ, .Exit                                                    ; переход, если ресурс уже загружен

                ; отключение пользовательского обработчика перед чтением с диска
                RES_USER_HANDLER

.Exit           ; восстановление идентификатора ресурса
                POP AF
                RET
; -----------------------------------------
; загрузка ресурса и передача управления его точке входа
; In:
;   A - идентификатор ресурса
; Out:
; Corrupt:
; Note:
;   ℹ️ код расположен в Kernel
; -----------------------------------------
ExeAssetCode:   EX AF, AF'                                                      ; сохранение идентификатора ресурса
                SET_PAGE_ASSETS                                                 ; включение страницы менеджера ресурсов
                EX AF, AF'                                                      ; восстановление идентификатора ресурса
                ; -----------------------------------------
                ; загрузка ресурса
                ; In:
                ;   A - идентификатор ресурса
                ; Out:
                ;   HL - адрес загруженного ресурса
                ;   IX - адрес структуры FAssets
                ;   флаг переполнения, установлен при нехватке непрерывной области ОЗУ
                ;   при успешной загрузке включена страница ресурса
                ; Note:
                ;   ℹ️ необходимо включить страницу с данными о доступной ОЗУ
                ;   портит данные буферов начиная с Adr.ExtraBuffer (TR-DOS)
                ;   временные 256 байт архивного ресурса не помечаются занятыми и после загрузки доступны следующей аллокации
                ; -----------------------------------------
                CALL AssetsManager.Load                                         ; получение ресурса из памяти или загрузка с диска
                CALL C, AssetsManager.TryToFree                                 ; попытка освободить память, если загрузка завершилась ошибкой
                DEBUG_BREAK_POINT_C                                             ; остановка отладки, если ошибка загрузки не устранена
                JP (HL)                                                         ; передача управления точке входа ресурса
; -----------------------------------------
; запуск нового или возобновление загруженного модуля
; In:
;   HL - адрес входа загруженного модуля
;   B  - бинд функции повторного запуска
;   IX - адрес структуры FAssets
; Out:
; Corrupt:
;   зависит от вызываемой функции
; Note:
;   ℹ️ код расположен в Kernel
;   - при первом запуске ресурса выполняется холодный автозапуск с биндом 0
;   - при повторных запусках до выгрузки ресурса выполняется горячий запуск с биндом из B
; -----------------------------------------
LaunchAsset:    ; проверка первого байта готового диспетчера, LD HL, nnnn
                LD A, (HL)
                SUB #21
                JR NZ, .Launch                                                  ; переход, если ресурс ещё не прошёл релокацию

                ; передача бинда повторного запуска готовому диспетчеру
                PUSH BC
.Launch         JP (HL)                                                         ; запуск релокатора или готового диспетчера модуля
; -----------------------------------------
; восстановление ресурса по сохранённому в стеке идентификатору
; In:
;   SP+0 - сохранённая пара AF, регистр A содержит идентификатор ресурса
; Out:
; Corrupt:
;   зависит от запускаемого кода ресурса
; Note:
;   ℹ️ код расположен в Kernel
; -----------------------------------------
RestoreAsset:   SET_PAGE_ASSETS                                                 ; включение страницы менеджера ресурсов
                ASSETS_POP                                                      ; получение идентификатора из стека и загрузка ресурса

                ; передача номера функции автостарта
                XOR A
                PUSH AF
                JP (HL)                                                         ; запуск восстановленного ресурса
; -----------------------------------------
; загрузка ресурса
; -----------------------------------------
LoadAsset:      ; функции загрузки ресурса с восстановлением страницы
; -----------------------------------------
; загрузка ресурса (находясь в странице)
; In:
;   A - идентификатор ресурса
; Out:
;   HL - адрес ресурса при успешной загрузке
;   IX - адрес структуры FAssets
; Corrupt:
;   HL, DE, BC, AF, AF', IX
; Note:
;   ℹ️ код расположен в Kernel
;   после возврата восстановлена страница вызывающего кода
; -----------------------------------------
.InPage         EX AF, AF'                                                      ; сохранение идентификатора ресурса
                PUSH_PAGE                                                       ; сохранение страницы вызывающего кода
                SET_PAGE_ASSETS                                                 ; включение страницы менеджера ресурсов
                EX AF, AF'                                                      ; восстановление идентификатора ресурса
                LOAD_ASSETS_A                                                   ; загрузка ресурса и включение его страницы
                JP_POP_PAGE                                                     ; восстановление страницы вызывающего кода
; -----------------------------------------
; загрузка ресурса с копированием его блока в буфер (находясь в странице)
; In:
;   HL - смещение блока от начала ресурса
;   DE - адрес буфера ниже #C000
;   BC - размер копируемого блока, не равен нулю
;   A - идентификатор ресурса
; Out:
;   HL - адрес начала блока в ресурсе
;   DE - исходный адрес буфера
;   IX - адрес структуры FAssets
; Corrupt:
;   HL, BC, AF, AF', IX
; Note:
;   ℹ️ код расположен в Kernel
;   после возврата восстановлена страница вызывающего кода
; -----------------------------------------
.BlockInPage    EX AF, AF'                                                      ; сохранение идентификатора ресурса
                PUSH_PAGE                                                       ; сохранение страницы вызывающего кода

                PUSH DE                                                         ; сохранение адреса буфера
                PUSH BC                                                         ; сохранение размера копируемого блока
                PUSH HL                                                         ; сохранение смещения блока в ресурсе

                SET_PAGE_ASSETS                                                 ; включение страницы менеджера ресурсов
                EX AF, AF'                                                      ; восстановление идентификатора ресурса
                LOAD_ASSETS_A                                                   ; загрузка ресурса и включение его страницы

                ; расчёт адреса копируемого блока в ресурсе
                POP BC                                                          ; восстановление смещения блока
                ADD HL, BC

                POP BC                                                          ; восстановление размера копируемого блока
                POP DE                                                          ; восстановление адреса буфера
                PUSH HL                                                         ; сохранение адреса блока для возврата вызывающему коду
                PUSH DE                                                         ; сохранение исходного адреса буфера

                ; копирование блока ресурса в буфер
                CALL Memcpy.FastLDIR
                POP DE                                                          ; восстановление исходного адреса буфера
                POP HL                                                          ; восстановление адреса начала блока в ресурсе
                JP_POP_PAGE                                                     ; восстановление страницы вызывающего кода
; -----------------------------------------
; освобождение ресурса (находясь в странице)
; In:
;   A - идентификатор ресурса
; Out:
;   IX - адрес структуры FAssets
; Corrupt:
;   HL, DE, BC, AF, AF', IX
; Note:
;   ℹ️ код расположен в Kernel
; -----------------------------------------
ReleaseAssetInPage:
                EX AF, AF'                                                      ; сохранение идентификатора ресурса
                PUSH_PAGE                                                       ; сохранение страницы вызывающего кода
                SET_PAGE_ASSETS                                                 ; включение страницы менеджера ресурсов
                EX AF, AF'                                                      ; восстановление идентификатора ресурса
                RELEASE_ASSET_A                                                 ; освобождение памяти ресурса и сброс признака загрузки
                JP_POP_PAGE                                                     ; восстановление страницы вызывающего кода

; -----------------------------------------
; пометка ресурса как невостребованного (находясь в странице)
; In:
;   A - идентификатор ресурса
; Out:
; Corrupt:
;   BC, AF, AF', IX
; Note:
;   ℹ️ код расположен в Kernel
; -----------------------------------------
MarkAsUnclaimed:EX AF, AF'                                                      ; сохранение идентификатора ресурса
                PUSH_PAGE                                                       ; сохранение страницы вызывающего кода
                SET_PAGE_ASSETS                                                 ; включение страницы менеджера ресурсов
                EX AF, AF'                                                      ; восстановление идентификатора ресурса
                OR A                                                            ; сброс флага переполнения для сохранения признака загрузки ресурса
                CALL AssetsManager.MarkAsUnclaimed                              ; пометка ресурса как невостребованного
                JP_POP_PAGE                                                     ; восстановление страницы вызывающего кода

                endif ; ~_FUNCTIONS_ASSET_UTILS_
