                ifndef _DRAW_HEXAGON_WORLD_
                define _DRAW_HEXAGON_WORLD_
; -----------------------------------------
; отображение гексагонального мира
; In:
; Out:
; Corrupt:
; Note:
;   отображение производится снизу вверх
; -----------------------------------------
World:          
                ; -----------------------------------------
                ; расчёт адреса таблицы в зависимости от смещения карты по горизонтали
.Shift_X        EQU $+1
                LD C, #00
                LD A, C
                ADD A, A    ; x2
                ADD A, C    ; x3
                ADD A, LOW HorizontalTable
                LD C, A
                LD B, HIGH HorizontalTable

                ; -----------------------------------------
                ; рассчёт адреса экранной области
                LD H, HIGH Adr.ScrAdrTable
.Shift_Y        EQU $+1
                LD L, (4 << 3) + 7                                              ; позиции по вертикали в пикселях
                LD E, (HL)
                INC E                                                           ; начало с 1 знакоместа
                INC H
                LD D, (HL)

                LD HL, Adr.RenderBuffer
                ; JP Row
                
; .Sprite         ;
;                 DB %00000011
;                 DB %00001101
;                 DB %10010000, %11111110 ; атрибуты

;                 DB %00110111
;                 DB %11111111
;                 DB %11101110
;                 DB %10111011
;                 DB %11111111
;                 DB %11111111
;                 DB %11010110
;                 DB %11111111
;                 DB %10010000, %11111110 ; атрибуты

;                 DB %01111111
;                 DB %01111110
;                 DB %10111111
;                 DB %11111011
;                 DB %11010111
;                 DB %11101111
;                 DB %10111111
;                 DB %11011110
;                 DB %10111100, %11111111 ; атрибуты

;                 DB %11111101
;                 DB %11011110
;                 DB %00111111
;                 DB %01110011
;                 DB %00111001
;                 DB %00011100
;                 DB %10001110
;                 DB %10001011
;                 DB %10111100, %00010001 ; атрибуты

;                 DB %11111111, %01111100
;                 DB %11111111, %00111001
;                 DB %11111111, %00111110
;                 DB %11111111, %10111101
;                 DB %11111111, %10011110
;                 DB %01111111, %01001101
;                 DB %00111111, %00101110
;                 DB %00111111, %00100100
;                 DB %10111100, %00000111 ; атрибуты

;                 DB %00011111, %00010001
;                 DB %00001110, %00001010
;                 DB %00000100, %00000100
;                 DB %10111100, %00000000 ; атрибуты

                display " - Draw hexagon world:\t\t\t\t", /A, World, "\t= busy [ ", /D, $-World, " byte(s)  ]"

                endif ; ~ _DRAW_HEXAGON_WORLD_